# Operations

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
df.head(n = 3) # show the first 3 rows only, default value n = 5

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [3]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df.tail(2)

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [5]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
df['col2'].nunique() # number of unique values

3

In [7]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

### Selecting Data

In [8]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [10]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [11]:
def times2(x):
    return x*2

In [12]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [13]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [14]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [15]:
df['col2'].sum()

np.int64(2109)

In [16]:
df['col2'].mean()

np.float64(527.25)

In [17]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [18]:
df['col1'].diff() # difference between current and previous rows

0    NaN
1    1.0
2    1.0
3    1.0
Name: col1, dtype: float64

In [19]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
df['col2'].diff(-1) # difference between current and next rows

0   -111.0
1   -111.0
2    222.0
3      NaN
Name: col2, dtype: float64

In [21]:
import numpy as np

np.exp(df['col1'])

0     2.718282
1     7.389056
2    20.085537
3    54.598150
Name: col1, dtype: float64

In [22]:
np.mean(df['col1'])

np.float64(2.5)

In [23]:
df['col1'].mean()

np.float64(2.5)

In [24]:
np.sin(df['col2'])

0   -0.860085
1    0.873283
2   -0.017642
3   -0.860085
Name: col2, dtype: float64

In [25]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [26]:
df['col2'].cumsum() # cummulative sum

0     444
1     999
2    1665
3    2109
Name: col2, dtype: int64

In [27]:
df['col1'].cumprod() # cummulative product

0     1
1     2
2     6
3    24
Name: col1, dtype: int64

**Permanently Removing a Column**

In [28]:
del df['col1']

In [29]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

**Get column and index names:**

In [30]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [31]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Sorting and Ordering a DataFrame:**

In [32]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [33]:
df.sort_values(by='col2', inplace = True)
df

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

**Find Null Values or Check for Null Values**

In [34]:
df.isnull()

    col2   col3
0  False  False
3  False  False
1  False  False
2  False  False

**Filling in NaN values with something else:**

In [35]:
import numpy as np

In [36]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [37]:
# Drop rows with NaN Values
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [38]:
df.dropna(axis = 1)

  col3
0  abc
1  def
2  ghi
3  xyz

In [39]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [40]:
df.fillna(111)

    col1   col2 col3
0    1.0  111.0  abc
1    2.0  555.0  def
2    3.0  666.0  ghi
3  111.0  444.0  xyz

In [41]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [42]:
values = {'col1':4, 'col2': 111}
df.fillna(values, inplace = True)

In [43]:
df

   col1   col2 col3
0   1.0  111.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   4.0  444.0  xyz